__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
generator_input (InputLayer)    (None, 128, 128, 8)  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 64) 25152       generator_input[0][0]            
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 128, 128, 64) 2           conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 128, 64) 0           instance_normalization[0][0]     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 128)  131200      activation[0][0]                 
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 64, 64, 128)  2           conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 64, 128)  0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 256)  524544      activation_1[0][0]               
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 32, 32, 256)  2           conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 256)  0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 256)  590080      activation_2[0][0]               
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 32, 32, 256)  2           conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 256)  0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 256)  0           activation_3[0][0]               
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 256)  590080      add[0][0]                        
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 32, 32, 256)  2           conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 256)  0           instance_normalization_4[0][0]   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 256)  0           activation_4[0][0]               
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 256)  590080      add_1[0][0]                      
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 32, 32, 256)  2           conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 256)  0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 256)  0           activation_5[0][0]               
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 256)  590080      add_2[0][0]                      
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 32, 32, 256)  2           conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 256)  0           instance_normalization_6[0][0]   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 256)  0           activation_6[0][0]               
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 256)  590080      add_3[0][0]                      
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 32, 32, 256)  2           conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 256)  0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 32, 256)  0           activation_7[0][0]               
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 256)  590080      add_4[0][0]                      
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 32, 32, 256)  2           conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 256)  0           instance_normalization_8[0][0]   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 32, 32, 256)  0           activation_8[0][0]               
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 64, 64, 128)  524416      add_5[0][0]                      
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 64, 64, 128)  2           conv2d_transpose[0][0]           
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 128)  0           instance_normalization_9[0][0]   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 128, 128, 64) 131136      activation_9[0][0]               
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 128, 128, 64) 2           conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 128, 128, 64) 0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 3)  9411        activation_10[0][0]              
__________________________________________________________________________________________________
generator_output (Activation)   (None, 128, 128, 3)  0           conv2d_9[0][0]                   
==================================================================================================
Total params: 4,886,361
Trainable params: 4,886,361
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
discriminator_input (InputLayer (None, 128, 128, 3)  0                                            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 64)   3136        discriminator_input[0][0]        
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 64, 64, 64)   0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 128)  131200      leaky_re_lu[0][0]                
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 32, 32, 128)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 256)  524544      leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 16, 16, 256)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 8, 8, 512)    2097664     leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 8, 8, 512)    0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 4, 4, 1024)   8389632     leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 4, 4, 1024)   0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 2, 2, 2048)   33556480    leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 2, 2, 2048)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
output_isreal (Conv2D)          (None, 2, 2, 1)      18433       leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
output_labels (Conv2D)          (None, 1, 1, 5)      40965       leaky_re_lu_5[0][0]              
==================================================================================================
Total params: 44,762,054
Trainable params: 44,762,054
Non-trainable params: 0
__________________________________________________________________________________________________
